app/Controllers/Auth.php

    public function attemptLogin()
    {
        $session = session();
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $userModel->where('username', $username)
                          ->where('is_active', 1)
                          ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `is_active` = 1
 LIMIT 1