app/Models/RoomsModel.php

SELECT `rooms`.*, `room_types`.`name` as `room_type_name`
FROM `rooms`
JOIN `room_types` ON `room_types`.`id` = `rooms`.`room_type_id`
---
    public function getAllRooms()
    {
        return $this->select('rooms.*, room_types.name as room_type_name')
                    ->join('room_types', 'room_types.id = rooms.room_type_id')
                    ->findAll();