app/Models/RoomTypesModel.php

SELECT `room_types`.*, `room_types`.`name` as `room_type_name`
FROM `room_types`
---
    public function getAllRoomTypes()
    {
        return $this->select('room_types.*, room_types.name as room_type_name')
            ->findAll();